[
  {
    "id": "GG",
    "title": "함께 울어주는 동반자 엔젤",
    "description": "당신은 함께 울어주는 동반자 엔젤이군요. 누군가의 아픔 앞에서 쉽게 눈물이 나고, 상대가 겪는 상실이나 슬픔을 마치 자신의 일처럼 받아들이며 곁에 서 있을 줄 아십니다. 당신은 공감과 위로의 힘을 누구보다 잘 이해하며, 상대가 말하지 못한 고통조차 감지해 따뜻하게 안아줍니다. 당신의 존재는 곁에 있는 것만으로도 큰 위로가 되며, 타인의 불안을 덜어주는 힘이 있습니다. 그러나 스스로의 감정을 돌보지 못하면 쉽게 지치고 소진되며, 타인에게 의존하거나 자기 희생적 태도로 이어질 수 있습니다. 타인을 지켜주는 동시에 자기 마음도 함께 보살피는 균형이 필요합니다.",
    "keywords": ["공감", "위로", "헌신", "동반자"],
    "growth": "당신은 스스로의 감정을 억누르지 않고 돌보는 연습이 필요합니다. 타인의 슬픔을 떠안기만 하기보다 나의 한계를 인정하고 때로는 거리를 두는 용기가 필요합니다. 자기 회복을 통해 더욱 안정된 힘으로 타인에게 진정한 위로를 건넬 수 있습니다."
  },
  {
    "id": "GT",
    "title": "현실에 맞서는 직설의 엔젤",
    "description": "당신은 현실에 맞서는 직설의 엔젤이군요. 불편한 진실도 피하지 않고, 필요한 말이라면 단도직입적으로 전할 수 있는 용기가 있습니다. 당신은 갈등을 회피하기보다 차라리 정면으로 부딪혀 해결을 모색하며, 논리와 직관을 바탕으로 상황을 주도합니다. 이러한 기질은 불공정하거나 억압적인 환경에서 강한 정의감을 발휘하게 하고, 타인에게는 든든한 지지대처럼 느껴지기도 합니다. 그러나 때로는 지나치게 단호한 태도가 상대에게 부담이나 상처를 줄 수 있으며, 대화의 온기를 잃고 갈등을 키우는 결과를 낳을 수도 있습니다. 당신의 강점은 솔직함에 있으나, 그 솔직함이 상대의 마음까지 보듬을 수 있을 때 더욱 빛을 발합니다.",
    "keywords": ["직설", "현실", "정의감", "솔직함"],
    "growth": "당신은 말의 힘을 어떻게 사용하는지가 중요합니다. 사실을 말하더라도 상대의 감정을 고려한 표현 방식을 익히면 관계가 더욱 단단해집니다. 단호함과 공감을 균형 있게 조화시킬 때, 당신의 목소리는 더 큰 설득력을 얻게 될 것입니다."
  },
  {
    "id": "GA",
    "title": "조용히 곁을 지키는 평화의 엔젤",
    "description": "당신은 조용히 곁을 지키는 평화의 엔젤이군요. 갈등을 키우기보다 차분히 물러서고, 상대의 감정을 먼저 살피며 큰 소란 없이 관계를 유지하려 합니다. 당신은 다정하고 배려심 깊어 타인에게 안정감을 주며, 혼자 감정을 삼키면서도 주변의 평화를 깨뜨리지 않으려 애씁니다. 상대가 불안하거나 외로울 때 묵묵히 곁을 지켜주는 태도는 따뜻한 힘이 되지만, 동시에 스스로는 상처를 쌓아두고 표현하지 못하는 위험이 있습니다. 겉으로는 온화하지만 속으로는 날카로운 관찰을 통해 불만을 쌓을 수 있고, 이는 결국 관계의 단절로 이어질 수도 있습니다. 당신의 조용한 힘은 귀하지만, 자신의 목소리를 잃지 않는 용기가 필요합니다.",
    "keywords": ["평화", "배려", "인내", "침묵"],
    "growth": "당신은 자신의 감정을 솔직하게 표현하는 연습이 필요합니다. 모든 갈등을 피할 수는 없으며, 때로는 부드럽지만 단호하게 입장을 드러내야 관계가 건강하게 유지됩니다. 내적 균형을 지키며 평화를 선택할 때, 진정한 안정이 찾아옵니다."
  },
  {
    "id": "GTA",
    "title": "균형을 맞추는 조율의 엔젤",
    "description": "당신은 균형을 맞추는 조율의 엔젤이군요. 상황에 따라 공감과 직설, 그리고 회피의 태도를 모두 적절히 사용할 줄 아는 유연함을 지녔습니다. 상대가 힘들어할 때는 위로를 아끼지 않고, 불공정한 일이 보이면 단호히 맞서며, 때로는 거리를 두어 스스로를 보호할 줄 압니다. 당신은 다양한 상황에서 적절한 반응을 택할 줄 아는 현명함 덕분에 주변의 신뢰를 얻고, 여러 사람들 사이에서 다리 역할을 합니다. 그러나 지나치게 모든 균형을 맞추려 하다 보면 정작 자신의 욕구와 진짜 감정을 놓칠 위험도 있습니다. 유연함 속에서도 자기 고유의 목소리를 잃지 않는 것이 중요합니다.",
    "keywords": ["조율", "균형", "유연함", "현명함"],
    "growth": "당신은 다양한 태도를 상황에 맞게 쓰는 능력을 이미 가지고 있습니다. 이제 필요한 것은 내면의 진심을 분명히 아는 일입니다. 나만의 가치와 우선순위를 확립하면, 균형은 타협이 아닌 자기 확신에서 비롯된 힘으로 자리 잡게 될 것입니다."
  },
  {
    "id": "TT",
    "title": "불꽃 같은 투쟁의 엔젤",
    "description": "당신은 불꽃 같은 투쟁의 엔젤이군요. 억압과 불공정에 쉽게 분노하며, 스스로와 타인의 권리를 지키기 위해 앞장서 싸우는 강한 기질을 지녔습니다. 상황이 부당하다면 침묵하지 않고 반드시 문제를 제기하며, 자신의 신념을 굽히지 않습니다. 이러한 용기와 직설은 집단 속에서 정의의 목소리가 되어 타인에게도 큰 울림을 줍니다. 그러나 상대가 따라오지 못할 만큼 강하게 밀어붙이면, 때로는 협력보다는 대립만을 남길 위험이 있습니다. 당신의 힘은 불의에 맞서는 단호함이지만, 그 힘이 상대의 상황을 이해하는 공감과 어우러질 때 더욱 큰 변화를 이끌 수 있습니다.",
    "keywords": ["투쟁", "정의", "용기", "강단"],
    "growth": "당신은 싸움의 과정 속에서도 관계를 지켜내는 법을 익힐 필요가 있습니다. 옳음을 주장하더라도 상대가 받아들일 수 있도록 온도와 속도를 조절한다면, 더 많은 이들이 당신의 뜻에 공감하고 함께 움직일 것입니다."
  },
  {
    "id": "TA",
    "title": "단호히 지켜내는 수호의 엔젤",
    "description": "당신은 단호히 지켜내는 수호의 엔젤이군요. 평소에는 온화하고 부드럽지만, 소중한 사람이 위협받거나 신뢰가 깨질 때는 누구보다 강하게 맞섭니다. 당신은 관계 속에서 진심과 책임을 중요하게 여기며, 필요할 때는 자신의 한계를 넘어 서서라도 상대를 지켜내려 합니다. 이는 당신이 가진 따뜻함과 용기의 결합에서 비롯된 힘입니다. 그러나 한 번의 배신이나 불신으로 인해 관계 전체를 단절하는 극단적 태도를 보일 수도 있으며, 자신을 소모시키면서까지 타인을 지키려는 경향이 있습니다. 당신의 힘은 한결같은 충직함이지만, 자기 보호의 경계도 놓치지 않아야 합니다.",
    "keywords": ["수호", "단호함", "책임", "신뢰"],
    "growth": "당신은 자신을 지켜내는 힘이 곧 타인을 지켜내는 힘이 된다는 점을 잊지 않아야 합니다. 헌신과 보호가 자기 소진으로 이어지지 않도록, 관계의 경계와 균형을 명확히 세울 필요가 있습니다."
  },
  {
    "id": "TTG",
    "title": "불의에 맞서는 개척의 엔젤",
    "description": "당신은 불의에 맞서는 개척의 엔젤이군요. 세상에서 불공정하거나 부조리한 장면을 보면 참지 못하고 가장 먼저 나서 문제를 드러내고 바꾸려는 의지를 지닙니다. 당신은 새로운 길을 열고 기존의 틀을 깨뜨리는 데 두려움이 없으며, 많은 이들이 회피하는 문제를 직면하게 만듭니다. 당신의 존재는 타인에게 도전 정신을 불어넣고, 숨겨진 목소리를 드러나게 하는 촉매제가 됩니다. 그러나 지나치게 공격적인 태도는 때로 상대의 저항을 불러일으켜 불필요한 적대감을 키울 수 있습니다. 당신의 투쟁은 변화를 만들어내는 힘이지만, 그것이 모두의 협력 속에서 지속되려면 조율의 감각이 필요합니다.",
    "keywords": ["개척", "투쟁", "정의", "변화"],
    "growth": "당신은 변화를 일으키는 원동력이지만, 변화를 유지하는 힘은 관계에서 비롯됩니다. 싸움 속에서도 대화를 놓치지 않고, 상대의 처지를 이해하는 태도를 익힌다면 더 큰 지지를 얻을 수 있을 것입니다."
  },
  {
    "id": "TTGA",
    "title": "정의와 평화를 잇는 조율의 엔젤",
    "description": "당신은 정의와 평화를 잇는 조율의 엔젤이군요. 갈등 앞에서도 양쪽의 사정을 끝까지 듣고, 어느 한쪽으로 치우치지 않으려는 균형 감각을 지녔습니다. 당신은 다툼 속에서 사람들을 이어주는 다리 역할을 하며, 정의를 지키는 동시에 관계의 파국을 막으려 합니다. 이는 누구도 쉽게 해내지 못하는 특별한 능력입니다. 그러나 지나친 조율은 자신의 의견을 드러내지 못하게 하거나, 모든 책임을 떠안게 만들 위험이 있습니다. 당신의 힘은 균형과 화해의 정신이지만, 그것이 자기 소멸이 되지 않도록 내면의 확고한 기준을 세워야 합니다.",
    "keywords": ["조율", "정의", "평화", "화해"],
    "growth": "당신은 다리를 놓는 존재이지만, 동시에 당신 자신이 무너지지 않도록 지켜야 합니다. 내 의견을 드러내되 타인의 말을 경청하는 이중의 태도를 유지할 때, 당신의 조율은 더욱 빛을 발하게 됩니다."
  },
  {
    "id": "AA",
    "title": "물러섬 속 지혜의 엔젤",
    "description": "당신은 물러섬 속 지혜의 엔젤이군요. 큰 다툼보다는 조용한 거리를 택하며, 갈등의 한가운데에서 벗어남으로써 자신과 상대 모두를 지켜냅니다. 당신은 상황을 예리하게 관찰하며 필요할 때는 한 발 물러서는 선택이 최선임을 압니다. 이러한 태도는 불필요한 상처를 줄이고 관계의 균형을 유지하게 합니다. 그러나 지나치게 물러서기만 한다면 당신의 진짜 마음은 드러나지 못하고, 오히려 고립과 단절로 이어질 수 있습니다. 당신의 힘은 부드러운 회피 속에서도 관계를 유지하는 지혜지만, 때로는 자기 목소리를 드러내야 진정한 평화를 얻을 수 있습니다.",
    "keywords": ["회피", "지혜", "관찰", "차분함"],
    "growth": "당신은 조용한 선택이 약함이 아님을 잘 압니다. 그러나 자기 감정을 묻어두는 것과 현명하게 표현하지 않는 것은 다릅니다. 부드럽게 그러나 분명히 말하는 훈련이 필요합니다."
  },
  {
    "id": "AG",
    "title": "은은히 감싸는 인내의 엔젤",
    "description": "당신은 은은히 감싸는 인내의 엔젤이군요. 상대의 감정을 쉽게 눈치채고, 불편한 상황이 와도 먼저 참으며 갈등이 지나가기를 기다립니다. 당신은 다정한 태도로 상대에게 따뜻함을 주며, 불필요한 소란을 만들지 않고 관계를 지켜냅니다. 그러나 지나친 인내는 자신을 희생시키며, 결국 마음속 불만을 쌓아두는 결과를 낳을 수 있습니다. 겉으로는 평화로워 보이지만 속에서는 상처가 깊어질 수 있습니다. 당신의 힘은 포용과 기다림에 있지만, 자기 목소리를 억누르기만 한다면 진정한 연결을 만들기 어렵습니다.",
    "keywords": ["인내", "포용", "다정함", "눈치"],
    "growth": "당신은 참는 법을 잘 알지만, 말하는 법도 배워야 합니다. 감정을 부드럽게 표현하며 상대와 나누는 순간, 관계는 더 단단해지고 당신 자신도 치유될 수 있습니다."
  },
  {
    "id": "AT",
    "title": "솔직함을 중시하는 진실의 엔젤",
    "description": "당신은 솔직함을 중시하는 진실의 엔젤이군요. 대화에서 돌려 말하기보다는 단도직입적인 언어를 선호하고, 감정을 숨기기보다는 드러내는 것이 중요하다고 생각합니다. 당신의 태도는 상대에게 신뢰감을 주고, 복잡한 관계 속에서도 명확함을 만들어냅니다. 그러나 지나치게 솔직한 표현은 상대를 상처 입힐 위험이 있으며, 따뜻한 대화보다 날카로운 언쟁으로 흐를 수 있습니다. 당신의 힘은 진실을 드러내는 데 있지만, 그 진실이 상대에게도 열릴 수 있도록 표현하는 법을 익힐 때 더 깊은 관계가 가능해집니다.",
    "keywords": ["솔직함", "진실", "명확함", "신뢰"],
    "growth": "당신은 이미 진실의 힘을 가지고 있습니다. 그러나 그 힘이 타인에게 다가가기 위해서는 온도의 조절이 필요합니다. 따뜻한 솔직함은 관계를 단단하게, 차가운 솔직함은 관계를 무너뜨릴 수 있음을 기억해야 합니다."
  },
  {
    "id": "ATG",
    "title": "단호한 주장의 엔젤",
    "description": "당신은 단호한 주장의 엔젤이군요. 자신이 옳다고 믿는 바가 있으면 쉽게 물러서지 않고, 타협보다는 끝까지 밀고 나가는 힘을 가졌습니다. 당신의 태도는 주변에 확신과 리더십을 심어주며, 때로는 집단의 방향을 결정짓는 원동력이 됩니다. 그러나 지나친 고집은 주변의 반감을 불러일으키고, 타인의 의견을 듣지 못하는 닫힌 태도로 비칠 수 있습니다. 당신의 힘은 굳건한 신념이지만, 그 신념이 진정한 설득으로 이어지기 위해서는 유연성이 필요합니다.",
    "keywords": ["신념", "단호함", "주장", "리더십"],
    "growth": "당신은 흔들림 없는 태도를 이미 가지고 있습니다. 그러나 모든 상황에서 불굴의 의지로만 나아간다면 오히려 고립될 수 있습니다. 신념을 지키면서도 다른 목소리를 경청할 줄 아는 균형이 필요합니다."
  },
  {
    "id": "ATGA",
    "title": "유연한 단호함의 엔젤",
    "description": "당신은 유연한 단호함의 엔젤이군요. 상황을 주도하는 힘을 가지고 있지만, 동시에 관계의 균형을 고려하며 때로는 물러날 줄도 압니다. 당신의 단호함은 맹목적이지 않고, 상황과 상대의 감정을 함께 보려는 태도에서 비롯됩니다. 그래서 당신은 지도자적 면모와 더불어 신뢰받는 중재자이기도 합니다. 그러나 모든 것을 조율하려는 태도가 자기 감정을 희생하게 만들 수 있고, 때로는 본래의 의도를 흐리게 할 수도 있습니다. 당신의 힘은 균형 잡힌 단호함에 있지만, 그 단호함이 자기 희생으로 이어지지 않도록 조심해야 합니다.",
    "keywords": ["유연함", "단호함", "조율", "신뢰"],
    "growth": "당신은 이미 리더와 중재자의 성격을 동시에 지니고 있습니다. 그러나 자신의 욕구를 끝까지 인정하고 받아들이는 과정이 필요합니다. 나를 잃지 않을 때, 당신의 단호함은 더 강력해지고 진정성 있게 다가갈 것입니다."
  },
  {
    "id": "AAG",
    "title": "내적 단절의 엔젤",
